---
kind: other
id: Methods.T:Autodesk.Revit.DB.MultiReferenceAnnotation
source: html/85cbdbb5-1612-7307-2930-65d74f7c0dcc.htm
---
# MultiReferenceAnnotation Methods

The method validates if the input elements match the element category id for the MultiReferenceAnnotationType.